<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="8" name="input" type="Parameter" version="opset1">
			<data shape="1,1280" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="inp_state_000" type="Parameter" version="opset1">
			<data shape="1,160" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_000">
					<dim>1</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="inp_state_001" type="Parameter" version="opset1">
			<data shape="1,161,1,2" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_001">
					<dim>1</dim>
					<dim>161</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="inp_state_002" type="Parameter" version="opset1">
			<data shape="1,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_002">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="inp_state_003" type="Parameter" version="opset1">
			<data shape="2,1,162,192" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_003">
					<dim>2</dim>
					<dim>1</dim>
					<dim>162</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="inp_state_004" type="Parameter" version="opset1">
			<data shape="2,8,1288,56" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_004">
					<dim>2</dim>
					<dim>8</dim>
					<dim>1288</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="inp_state_005" type="Parameter" version="opset1">
			<data shape="2,8,56,1288" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_005">
					<dim>2</dim>
					<dim>8</dim>
					<dim>56</dim>
					<dim>1288</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inp_state_006" type="Parameter" version="opset1">
			<data shape="1,2,2,161" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_006">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="inp_state_007" type="Parameter" version="opset1">
			<data shape="1,2,8,161" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="inp_state_007">
					<dim>1</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/neural_model/Concat_7_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1, 2, 2, 161, 4" offset="0" size="20608" />
			<output>
				<port id="0" precision="I64" names="/neural_model/Concat_7_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>161</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_output_0">
					<dim>1</dim>
					<dim>1440</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Constant_1_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20608" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1440</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1440</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="stft.forward_basis_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="322, 1, 320" offset="20616" size="206080" />
			<output>
				<port id="0" precision="FP16" names="stft.forward_basis">
					<dim>322</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="stft.forward_basis" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>322</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>322</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Conv" type="Convolution" version="opset1">
			<data strides="160" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1440</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>322</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Conv_output_0">
					<dim>1</dim>
					<dim>322</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Constant_4_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226696" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Constant_5_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226704" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>322</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/Constant_11_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226712" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_1_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/Constant_9_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226720" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>322</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/Slice_1_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_2_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/Concat_1" type="Concat" version="opset1">
			<data axis="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_1_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_375" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="226728" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/neural_model/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/Transpose_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/neural_model/Concat" type="Concat" version="opset1">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>161</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/Concat_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_3885_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 2, 3, 3" offset="226760" size="2304" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3885">
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="onnx::Conv_3885" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/neural_model/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>10</dim>
					<dim>161</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_390_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="229064" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_390" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/neural_model/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/neural_model/fusion_blocks.0/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/neural_model/fusion_blocks.0/Constant_2_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229192" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/Constant_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/neural_model/fusion_blocks.0/Tile" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Tile_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ShapeOf_404" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_407" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226696" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_406" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="229216" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_408" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20608" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StridedSlice_409" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_410" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="226696" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="43" name="ReduceProd_411" type="ReduceProd" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_412" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="229224" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Concat_413" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/neural_model/fusion_blocks.0/Flatten" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Flatten_output_0">
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/neural_model/fusion_blocks.0/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Unsqueeze_1_output_0">
					<dim>161</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/neural_model/fusion_blocks.0/Constant_4_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229232" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/Constant_4_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/neural_model/fusion_blocks.0/Tile_1" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Tile_1_output_0">
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_5706_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 64" offset="229256" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_5706" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_443" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/neural_model/fusion_blocks.0/attn/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Transpose_4835_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="229408" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Transpose_4835" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/neural_model/fusion_blocks.0/attn/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/MatMul_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/neural_model/fusion_blocks.0/attn/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Add_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/neural_model/fusion_blocks.0/attn/Constant_11_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="237600" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/attn/Constant_11_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/neural_model/fusion_blocks.0/attn/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_3_output_0">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_461" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/neural_model/fusion_blocks.0/attn/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_3_output_0">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/neural_model/fusion_blocks.0/attn/Constant_14_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="237624" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/attn/Constant_14_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/neural_model/fusion_blocks.0/attn/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_6_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_5707_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="237656" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_5707" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/neural_model/fusion_blocks.0/attn/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Mul_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_5708_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 128" offset="237658" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_5708" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_392" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="226728" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/neural_model/fusion_blocks.0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>161</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Transpose_output_0">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/neural_model/fusion_blocks.0/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="237914" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/Constant_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/neural_model/fusion_blocks.0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/Reshape_output_0">
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_445" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/neural_model/fusion_blocks.0/attn/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_1_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transpose_4844_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64" offset="237938" size="16384" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Transpose_4844" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/neural_model/fusion_blocks.0/attn/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/MatMul_1_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/neural_model/fusion_blocks.0/attn/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Add_1_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/neural_model/fusion_blocks.0/attn/Concat_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="254322" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/attn/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/neural_model/fusion_blocks.0/attn/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_2_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/neural_model/fusion_blocks.0/attn/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_4689" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="226696" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Squeeze_4690" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_4691" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="254354" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/neural_model/fusion_blocks.0/attn/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Squeeze_output_0">
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/Constant_2_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="226696" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="87" name="Constant_456" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="226696" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="88" name="/neural_model/fusion_blocks.0/attn/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Gather_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/neural_model/fusion_blocks.0/attn/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_4_output_0">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_464" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/neural_model/fusion_blocks.0/attn/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_4_output_0">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/neural_model/fusion_blocks.0/attn/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_7_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_472" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="254386" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/neural_model/fusion_blocks.0/attn/Transpose_6" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_6_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_5709_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="237656" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_5709" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/neural_model/fusion_blocks.0/attn/Mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Mul_1_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/neural_model/fusion_blocks.0/attn/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/MatMul_2_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/neural_model/fusion_blocks.0/attn/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Softmax_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="20608" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="101" name="Constant_458" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="226696" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="102" name="/neural_model/fusion_blocks.0/attn/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Gather_1_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/neural_model/fusion_blocks.0/attn/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_5_output_0">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_467" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/neural_model/fusion_blocks.0/attn/Transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>644</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_5_output_0">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/neural_model/fusion_blocks.0/attn/Reshape_8" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>644</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_8_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/neural_model/fusion_blocks.0/attn/MatMul_3" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/MatMul_3_output_0">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_479" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="254354" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/neural_model/fusion_blocks.0/attn/Transpose_7" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>161</dim>
					<dim>4</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Transpose_7_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Concat_2540" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="254418" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/neural_model/fusion_blocks.0/attn/Reshape_9" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>4</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_9_output_0">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="neural_model.fusion_blocks.0.attn.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="254434" size="8192" />
			<output>
				<port id="0" precision="FP16" names="neural_model.fusion_blocks.0.attn.out_proj.weight">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="neural_model.fusion_blocks.0.attn.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/neural_model/fusion_blocks.0/attn/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_5710_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="262626" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_5710" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/neural_model/fusion_blocks.0/attn/Gemm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Gemm_output_0">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/neural_model/fusion_blocks.0/attn/Constant_21_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="262754" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/neural_model/fusion_blocks.0/attn/Constant_21_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="/neural_model/fusion_blocks.0/attn/Reshape_10" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1288</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/neural_model/fusion_blocks.0/attn/Reshape_10_output_0">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_489" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="229384" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/neural_model/fusion_blocks.0/attn/Transpose_8" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>161</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
